<script setup lang="ts">
	import { ref } from 'vue'
</script>

<template>
	<section class="autobiography">
		<h2>自傳</h2> <!-- My projects or 聯絡方式 -->
		<div>
			<p>您好，我是沈采蓉，我從大學畢業後就進入前端開發領域，到現在已經有 10 年的經驗了。這段時間我主要負責企業官網、活動頁面，還有公司內部管理系統的開發。對我來說，工程師不只是把設計稿換成程式碼，更重要的是能穩定地解決公司的實務需求，並讓系統好用且容易維護。</p>
			<p>我有跨部門溝通的經驗，曾帶領過以我為技術核心的團隊，和 UI 設計師及編輯人員合作開發中型網站，並且擅長把模糊的業務需求轉化為清楚的技術規格，並確保專案在穩定預期內上線，在開發流程中也會善用 AI 工具來提升 Debug 和重構的效率，把時間花在更有產值的專案規劃上。</p>
			<p>目前我正在自學 Vue.js，希望能將累積的 JS 功力與現代框架結合，並且希望能找到一份重視開發品質且環境穩定的職缺，讓我能發揮 10 年來的穩定戰力，為團隊解決實際的技術問題。</p>
		</div>
	</section>
</template>